/*ARDUINO ПЕРЕДАЁТ*/

//---------------- БИБЛИОТЕКИ START ---------------------
#include <Arduino.h>
//----------------- БИБЛИОТЕКИ END-----------------------


//-------------------- DEFINE START ---------------------

//-------------------- DEFINE END -----------------------


//------------ СОЗДАНИЕ ЭКЗЕМПЛЯРА START ----------------

//------------- СОЗДАНИЕ ЭКЗЕМПЛЯРА END -----------------


//---------------- ПЕРЕМЕННЫЕ START----------------------

//----------------- ПЕРЕМЕННЫЕ END ----------------------


//----------------- СПИСОК ФУНКЦИЙ START-----------------

//----------------- СПИСОК ФУНКЦИЙ END ------------------


//--------------------- SETUP START ---------------------
void setup(void) {
  Serial.begin(115200);  // открываем порт для связи с ПК

}
//--------------------- SETUP END ----------------------


//------------------- LOOP START -----------------------
void loop(void) {
 int a = 10;
  int b = 20;
  int c = 30;

  // Отправка данных
  Serial.print(a);
  Serial.print(",");
  Serial.print(b);
  Serial.print(",");
  Serial.println(c);

  // Задержка перед следующей отправкой
  delay(2000);
}
//--------------------- LOOP END ----------------------
